{
    "Brief": [
        "Sahil has been brought up among computers, by programmer parents since childhood, so his natural inclination is towards technology. His professional journey began in 2015, from a home-grown startup and then things progressed from there. Over the years, he has been fortunate to work in different areas with different teams across different size companies, startups and corporates, involving Software Engineering and Development, User Experience Design, DevOps, Security.",
        "But, along the way Sahil found his calling in design and thus, has been building and working with user interfaces, particularly Frontend Development and User Experience Design."
    ],
    "Skills": [
        {
            "name": "HTML",
            "logo": "assets/about/skills/skill-1.svg"
        },
        {
            "name": "CSS",
            "logo": "assets/about/skills/skill-2.svg"
        },
        {
            "name": "JavaScript",
            "logo": "assets/about/skills/skill-3.svg"
        },
        {
            "name": "TypeScript",
            "logo": "assets/about/skills/skill-4.svg"
        },
        {
            "name": "SCSS",
            "logo": "assets/about/skills/skill-5.svg"
        },
        {
            "name": "Bootstrap",
            "logo": "assets/about/skills/skill-9.svg"
        },
        {
            "name": "Angular",
            "logo": "assets/about/skills/skill-6.svg"
        },
        {
            "name": "RxJS",
            "logo": "assets/about/skills/skill-7.svg"
        },
        {
            "name": "Docker",
            "logo": "assets/about/skills/skill-10.svg"
        },
        {
            "name": "Figma",
            "logo": "assets/about/skills/skill-11.svg"
        },
        {
            "name": "Adobe XD",
            "logo": "assets/about/skills/skill-12.svg"
        }
    ],
    "Work": [
        {
            "title": "Senior Software Analyst - UX & UI",
            "company": "Ericsson Global India",
            "logo": "assets/about/company-3.svg",
            "unit": "Mediation Unit, R&D",
            "duration": "October 2020 - Present",
            "brief": "This is the first large-scale corporate company, that Sahil has worked with and continue to do so, since 2018(full-time). Ericsson is a mammoth organisation with huge scale and every contribution makes a large impact.",
            "details": [
                "Working in Mediation business unit under the BSS product development group.",
                "SME in frontend development across unit’s different projects and teams, in telecom domain.",
                "Responsible for leading the design, development and maintenance of unit’s enterprise Angular UI SDK; which is being used to develop frontend apps.",
                "Responsible for forming and running unit’s first Frontend Community of Practice(CoP).",
                "Part of unit’s core frontend team and UX team, responsible for strategizing and executing product critical activities.",
                "Actively contribute to UX activities and deliverables like product user flows, wireframing, user interviews, persona designing, migration of design system, etc.",
                "Trained co-developers around frontend frameworks and tools according to specific project requirements.",
                "Lead small teams of frontend developers."
            ],
            "recognition": [
                {
                    "title": "Hero Award (2022 Q2)",
                    "date": "August 2022",
                    "description": "Rewarded for successfully completing quality deliverables within the timeframe, persistently."
                },
                {
                    "title": "Power Award (2022 Q1)",
                    "date": "May 2022",
                    "description": "Rewarded for outstanding contributions towards the unit's targets."
                },
                {
                    "title": "Power Award (2020 Q4)",
                    "date": "December 2020",
                    "description": "For exhibiting tremendous perseverance in imbibing new UI framework from scratch and strategizing and aligning it closest to the new guidelines chalked out, avoiding huge efforts in redesigning."
                }
            ]
        },
        {
            "title": "Software Developer",
            "company": "Ericsson Global India",
            "logo": "assets/about/company-3.svg",
            "unit": "Mediation Unit, R&D",
            "duration": "March 2018 - October 2020",
            "brief": "",
            "details": [
                "Responsible for development of components for the unit’s internal enterprise Angular UI SDK.",
                "Worked in multiple agile teams to deliver an enterprise Angular application with advanced use-cases for telecom operators, being used around the globe.",
                "Trained co-developers around the ways-of-working for unit's internal enterprise Angular UI SDK along with pre-requisite frontend technology and tools."
            ],
            "recognition": [
                {
                    "title": "Ace Award 2018 (Q4)",
                    "date": "February 2019",
                    "description": "Awarded for outstanding contribution towards the unit's targets."
                },
                {
                    "title": "Among Top 10 Hacks: Event Based Notifications",
                    "date": "September 2018",
                    "description": "Platform agnostic PWA which plugs into an event-based system that emits custom notifications and allows to take simple and voice actions. Among top ten selected projects at the yearly hackathon held at Ericsson R&D."
                }
            ]
        },
        {
            "title": "UI/UX Developer Intern",
            "company": "Ericsson Global India",
            "logo": "assets/about/company-3.svg",
            "unit": "NGVS Team & Mediation Unit, R&D",
            "duration": "January 2016 - June 2016",
            "brief": "Responsible to design and develop the user interface of one of the Ericsson’s enterprise software, in coordination with UX and software development teams, at BUSS R&D.",
            "details": [],
            "recognition": []
        },
        {
            "title": "UI/UX Developer",
            "company": "edWisor.com",
            "logo": "assets/about/company-2.jpeg",
            "unit": "Design Team",
            "duration": "January 2018 - March 2018",
            "brief": "Responsible for consulting and guiding the startup organisation in UI/UX designing and software development/engineering, for more than 10 client projects.",
            "details": [],
            "recognition": []
        },
        {
            "title": "Tech Consultant (Part Time)",
            "company": "Systematic System Solutions (SSS)",
            "logo": "assets/about/company-1.jpeg",
            "unit": "Software Development Team",
            "duration": "May 2015 - August 2017",
            "brief": "Responsible for consulting and guiding the startup organisation in UI/UX designing and software development/engineering, for more than 10 client projects.",
            "details": [],
            "recognition": []
        }
    ],
    "Volunteering": [
        {
            "title": "Technologist (Part-Time)",
            "company": "The Aashansh Foundation",
            "logo": "assets/about/volunteering/aashansh.jpeg",
            "duration": "January 2016 - July 2016",
            "brief": "Responsible for leading the non-profit organisation towards technological goals, revolving around website development and teaching programming to children who were deprived of necessary resources. It was a brief period as the chairman was still exploring the organisation's future. Nothing substantial got done but got to know few processes."
        },
        {
            "title": "Instructor",
            "company": "CodersTrust",
            "logo": "assets/about/volunteering/hourofcode.png",
            "duration": "December 2015",
            "brief": "Participated in Hour of Code, Code.org's initiative as an Instructor under CodersTrust. It was really fun teaching basics of computers and programming to few elementary class students who were quite willing to learn but didn't have the resources. It was a single day event and preparations were done few days in advance, where a core group of volunteers were formed. Also, this is where Aashansh's chairman met."
        },
        {
            "title": "Campus Ambassador",
            "company": "MyPoolin",
            "logo": "assets/about/volunteering/mypoolin.png",
            "duration": "October 2014 - November 2014",
            "brief": "Responsible for spreading awareness about MyPoolin on IIIT-D campus via social media. Nothing substantial got done in this direction, but MyPoolin was at nascent stage during that time and it allowed to get direct access to Co-founders. This helped to understand their mindset and got introduced to the world of entrepreneurship. Went to startup fairs(only one at IIT-Delhi) and spent sometime with co-founders physically(also virtually on calls)."
        },
        {
            "title": "Student Ambassador",
            "company": "International Conference on Software Engineering",
            "logo": "assets/about/volunteering/icse.png",
            "duration": "June 2014",
            "brief": "First ever conference attended, flew from Delhi to Hyderabad on first air trip. Got selected as a volunteer from over 150 applications(worldwide), with the help of education background and Prof. H.B. Acharya's recommendation. Learned a ton about different research areas(in software engineering specifically) and networking; met people from different parts of the world and lived together for a week."
        },
        {
            "title": "Stock Verifier",
            "company": "IIIT-D Library",
            "logo": "assets/about/university-1.png",
            "duration": "December 2013",
            "brief": "Volunteered to do periodic library chores at campus like verifying stock, putting books in correct slots, etc. This gave exposure different types of books, their specific book-keeping requirements, tech magazines, etc and made good friends with library staff(which consisted of 2-3 people at that time). This one month volunteering provided with the first ever pay check!"
        }
    ],
    "Education": [
        {
            "university": "Indraprastha Institute of Information Technology (IIIT-D)",
            "degree": "Bachelor of Technology, Computer Science Engineering",
            "logo": "assets/about/university-1.png",
            "duration": "2013-2017",
            "brief": "Sahil owe a lot to his university which broadened his horizon about research, technology, software, design, and wonderful professors who encouraged exploring and experimenting.",
            "coursework": "Major coursework included courses from Design, Software, IoT, Security & Entrepreneurship."
        }
    ]
}
